# ======================================
# コマンドマニュアル自動作成用基礎データ
# ======================================
db={}
db['name']='heron'
db['title']='三角形の面積'
db['forms']=[
  ["heron","タイプ,num_1,num_2,...,n_k,num_{k+1},num_{k+2},...,num_{2k},num_{2k+1},num_{2k+2},...,num_{3k}","m,m,m,r,m,m,m,r,m,m,m,r,m",""]
]
############################### DOCUMENT
db['doc']='''
k次元空間の3点の座標$(num_1,num_2,\cdots,n_k),(num_{k+1},num_{k+2},\cdots,num_{2k)}
,(num_{2k+1},num_{2k+2},\cdots,num_{3k})$によって作られる3角形の面積を計算する。
'''

