# ======================================
# コマンドマニュアル自動作成用基礎データ
# ======================================
db={}
db['name']='month'
db['title']='月'
db['forms']=[
  ["month","date","m","数値型月番号"],
  ["month","time","m","数値型月番号"],
  ["months","date","m","文字列型2桁固定長月番号"],
  ["months","time","m","文字列型2桁固定長月番号"],
  ["monthe","date","m","英語表記"],
  ["monthe","time","m","英語表記"],
  ["monthes","date","m","英語短縮表記"],
  ["monthes","time","m","英語短縮表記"]
]
############################### DOCUMENT
db['doc']='''
日付 :math:`date` もしくは時刻 :math:`time` から月を返す。
月の表記によって書式1〜8を使い分ける。
'''

